Revit 2021.1 API
MacroLanguageType Enumeration
 The Macro language types.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2014
Since: 2014
Syntax
C#
public enum MacroLanguageType
Visual Basic
Public Enumeration MacroLanguageType
Visual C++
public enum class MacroLanguageType
Members
Member name | Description
CSharp |  The C# language.
VBNet |  The VB.NET language.
Ruby |  The Ruby language.
Python |  The Python language.
See Also
Autodesk.Revit.DB.Macros Namespace